{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "-": 1,
      "0": 2,
      "1": 3,
      "2": 4,
      "3": 5,
      "4": 6,
      "5": 7,
      "6": 8,
      "7": 9,
      "8": 10,
      "9": 11,
      "11": 12,
      "10": 13,
      "12": 14,
      "00": 15,
      "13": 16,
      "16": 17,
      "14": 18,
      "15": 19,
      "17": 20,
      "19": 21,
      "20": 22,
      "18": 23,
      "24": 24,
      "25": 25,
      "23": 26,
      "28": 27,
      "27": 28,
      "29": 29,
      "26": 30,
      "36": 31,
      ",-": 32,
      "40": 33,
      "30": 34,
      "37": 35,
      "48": 36,
      "35": 37,
      "99": 38,
      "38": 39,
      "45": 40,
      "47": 41,
      "46": 42,
      "39": 43,
      "49": 44,
      "56": 45,
      "57": 46,
      "50": 47,
      "88": 48,
      "60": 49,
      "33": 50,
      "77": 51,
      "80": 52,
      "59": 53,
      "44": 54,
      "66": 55,
      "22": 56,
      "58": 57,
      "67": 58,
      "69": 59,
      "68": 60,
      "55": 61,
      "70": 62,
      "43": 63,
      "79": 64,
      "89": 65,
      "32": 66,
      "34": 67,
      "21": 68,
      "87": 69,
      "90": 70,
      "64": 71,
      "65": 72,
      "78": 73,
      "0000": 74,
      "53": 75,
      "97": 76,
      "54": 77,
      "63": 78,
      "42": 79,
      "96": 80,
      "76": 81,
      "98": 82,
      "52": 83,
      "31": 84,
      "75": 85,
      "84": 86,
      "100": 87,
      "1111": 88,
      "72": 89,
      "41": 90,
      "73": 91,
      "85": 92,
      "86": 93,
      "83": 94,
      "120": 95,
      "74": 96,
      "95": 97,
      "110": 98,
      "000": 99,
      "93": 100,
      "62": 101,
      "61": 102,
      "92": 103,
      "51": 104,
      "94": 105,
      "81": 106,
      "82": 107,
      "71": 108,
      "160": 109,
      "140": 110,
      "130": 111,
      "240": 112,
      "150": 113,
      "180": 114,
      "91": 115,
      "128": 116,
      "109": 117,
      "144": 118,
      "280": 119,
      "170": 120,
      "107": 121,
      "108": 122,
      "200": 123,
      "125": 124,
      "190": 125,
      "105": 126,
      "127": 127,
      "360": 128,
      "230": 129,
      "250": 130,
      "104": 131,
      "211": 132,
      "126": 133,
      "103": 134,
      "106": 135,
      "113": 136,
      "9999": 137,
      "129": 138,
      "137": 139,
      "270": 140,
      "119": 141,
      "101": 142,
      "168": 143,
      "480": 144,
      "260": 145,
      "256": 146,
      "139": 147,
      "136": 148,
      "117": 149,
      "112": 150,
      "216": 151,
      "116": 152,
      "149": 153,
      "123": 154,
      "156": 155,
      "157": 156,
      "147": 157,
      "290": 158,
      "118": 159,
      "220": 160,
      "138": 161,
      "115": 162,
      "225": 163,
      "135": 164,
      "223": 165,
      "114": 166,
      "224": 167,
      "176": 168,
      "169": 169,
      "179": 170,
      "288": 171,
      "124": 172,
      "199": 173,
      "148": 174,
      "210": 175,
      "133": 176,
      "177": 177,
      "229": 178,
      "111": 179,
      "167": 180,
      "145": 181,
      "121": 182,
      "143": 183,
      "227": 184,
      "218": 185,
      "400": 186,
      "159": 187,
      "197": 188,
      "390": 189,
      "460": 190,
      "380": 191,
      "196": 192,
      "350": 193,
      "208": 194,
      "146": 195,
      "00000000": 196,
      "450": 197,
      "11111111": 198,
      "102": 199,
      "370": 200,
      "192": 201,
      "300": 202,
      "560": 203,
      "158": 204,
      "189": 205,
      "134": 206,
      "155": 207,
      "178": 208,
      "165": 209,
      "226": 210,
      "163": 211,
      "228": 212,
      "187": 213,
      "175": 214,
      "209": 215,
      "173": 216,
      "153": 217,
      "257": 218,
      "198": 219,
      "490": 220,
      "193": 221,
      "184": 222,
      "188": 223,
      "239": 224,
      "132": 225,
      "470": 226,
      "166": 227,
      "207": 228,
      "131": 229,
      "122": 230,
      "154": 231,
      "186": 232,
      "336": 233,
      "248": 234,
      "233": 235,
      "195": 236,
      "320": 237,
      "185": 238,
      "277": 239,
      "152": 240,
      "880": 241,
      "164": 242,
      "269": 243,
      "289": 244,
      "174": 245,
      "194": 246,
      "375": 247,
      "249": 248,
      "368": 249,
      "990": 250,
      "296": 251,
      "384": 252,
      "576": 253,
      "212": 254,
      "259": 255,
      "204": 256,
      "214": 257,
      "255": 258,
      "307": 259,
      "151": 260,
      "237": 261,
      "205": 262,
      "590": 263,
      "264": 264,
      "327": 265,
      "359": 266,
      "570": 267,
      "206": 268,
      "376": 269,
      "247": 270,
      "217": 271,
      "456": 272,
      "235": 273,
      "297": 274,
      "236": 275,
      "243": 276,
      "409": 277,
      "408": 278,
      "1010": 279,
      "258": 280,
      "213": 281,
      "238": 282,
      "203": 283,
      "379": 284,
      "219": 285,
      "181": 286,
      "367": 287,
      "389": 288,
      "279": 289,
      "183": 290,
      "246": 291,
      "287": 292,
      "267": 293,
      "268": 294,
      "245": 295,
      "496": 296,
      "299": 297,
      "191": 298,
      "457": 299,
      "162": 300,
      "265": 301,
      "276": 302,
      "488": 303,
      "479": 304,
      "377": 305,
      "234": 306,
      "330": 307,
      "286": 308,
      "266": 309,
      "161": 310,
      "263": 311,
      "215": 312,
      "397": 313,
      "298": 314,
      "141": 315,
      "378": 316,
      "244": 317,
      "369": 318,
      "304": 319,
      "309": 320,
      "275": 321,
      "625": 322,
      "467": 323,
      "313": 324,
      "999": 325,
      "335": 326,
      "487": 327,
      "285": 328,
      "347": 329,
      "388": 330,
      "308": 331,
      "201": 332,
      "1000": 333,
      "295": 334,
      "241": 335,
      "337": 336,
      "670": 337,
      "690": 338,
      "278": 339,
      "489": 340,
      "293": 341,
      "512": 342,
      "142": 343,
      "357": 344,
      "306": 345,
      "253": 346,
      "283": 347,
      "407": 348,
      "396": 349,
      "497": 350,
      "171": 351,
      "311": 352,
      "770": 353,
      "305": 354,
      "469": 355,
      "232": 356,
      "504": 357,
      "387": 358,
      "656": 359,
      "252": 360,
      "254": 361,
      "385": 362,
      "405": 363,
      "600": 364,
      "464": 365,
      "468": 366,
      "324": 367,
      "349": 368,
      "459": 369,
      "890": 370,
      "465": 371,
      "294": 372,
      "577": 373,
      "888": 374,
      "353": 375,
      "284": 376,
      "790": 377,
      "477": 378,
      "500": 379,
      "182": 380,
      "569": 381,
      "273": 382,
      "281": 383,
      "172": 384,
      "356": 385,
      "373": 386,
      "398": 387,
      "420": 388,
      "509": 389,
      "608": 390,
      "312": 391,
      "358": 392,
      "455": 393,
      "365": 394,
      "348": 395,
      "406": 396,
      "448": 397,
      "495": 398,
      "458": 399,
      "383": 400,
      "251": 401,
      "499": 402,
      "476": 403,
      "478": 404,
      "399": 405,
      "317": 406,
      "440": 407,
      "272": 408,
      "568": 409,
      "355": 410,
      "386": 411,
      "3333": 412,
      "466": 413,
      "364": 414,
      "609": 415,
      "432": 416,
      "221": 417,
      "498": 418,
      "486": 419,
      "587": 420,
      "374": 421,
      "395": 422,
      "202": 423,
      "231": 424,
      "366": 425,
      "607": 426,
      "222": 427,
      "274": 428,
      "340": 429,
      "315": 430,
      "444": 431,
      "345": 432,
      "475": 433,
      "485": 434,
      "589": 435,
      "808": 436,
      "720": 437,
      "579": 438,
      "00000": 439,
      "401": 440,
      "809": 441,
      "889": 442,
      "333": 443,
      "429": 444,
      "419": 445,
      "325": 446,
      "271": 447,
      "262": 448,
      "439": 449,
      "323": 450,
      "567": 451,
      "507": 452,
      "997": 453,
      "505": 454,
      "777": 455,
      "449": 456,
      "655": 457,
      "578": 458,
      "328": 459,
      "008": 460,
      "508": 461,
      "597": 462,
      "696": 463,
      "709": 464,
      "352": 465,
      "463": 466,
      "575": 467,
      "484": 468,
      "887": 469,
      "689": 470,
      "585": 471,
      "314": 472,
      "316": 473,
      "506": 474,
      "329": 475,
      "687": 476,
      "343": 477,
      "354": 478,
      "319": 479,
      "1024": 480,
      "339": 481,
      "326": 482,
      "6666": 483,
      "361": 484,
      "776": 485,
      "331": 486,
      "310": 487,
      "318": 488,
      "404": 489,
      "998": 490,
      "595": 491,
      "441": 492,
      "807": 493,
      "338": 494,
      "679": 495,
      "242": 496,
      "334": 497,
      "584": 498,
      "346": 499,
      "596": 500,
      "555": 501,
      "99999999": 502,
      "598": 503,
      "896": 504,
      "797": 505,
      "697": 506,
      "443": 507,
      "676": 508,
      "009": 509,
      "392": 510,
      "996": 511,
      "586": 512,
      "601": 513,
      "667": 514,
      "669": 515,
      "416": 516,
      "261": 517,
      "565": 518,
      "321": 519,
      "1100": 520,
      "666": 521,
      "303": 522,
      "779": 523,
      "524": 524,
      "8888": 525,
      "1110": 526,
      "434": 527,
      "344": 528,
      "301": 529,
      "474": 530,
      "566": 531,
      "805": 532,
      "664": 533,
      "605": 534,
      "7777": 535,
      "606": 536,
      "995": 537,
      "454": 538,
      "394": 539,
      "678": 540,
      "675": 541,
      "875": 542,
      "000000": 543,
      "665": 544,
      "668": 545,
      "461": 546,
      "707": 547,
      "2222": 548,
      "708": 549,
      "494": 550,
      "472": 551,
      "431": 552,
      "503": 553,
      "698": 554,
      "806": 555,
      "292": 556,
      "778": 557,
      "672": 558,
      "393": 559,
      "433": 560,
      "282": 561,
      "481": 562,
      "540": 563,
      "704": 564,
      "784": 565,
      "007": 566,
      "363": 567,
      "775": 568,
      "796": 569,
      "885": 570,
      "798": 571,
      "351": 572,
      "685": 573,
      "686": 574,
      "976": 575,
      "641": 576,
      "876": 577,
      "897": 578,
      "886": 579,
      "594": 580,
      "564": 581,
      "909": 582,
      "341": 583,
      "878": 584,
      "593": 585,
      "1200": 586,
      "462": 587,
      "907": 588,
      "547": 589,
      "898": 590,
      "414": 591,
      "992": 592,
      "437": 593,
      "445": 594,
      "403": 595,
      "430": 596,
      "436": 597,
      "683": 598,
      "424": 599,
      "592": 600,
      "729": 601,
      "552": 602,
      "1600": 603,
      "705": 604,
      "561": 605,
      "840": 606,
      "435": 607,
      "523": 608,
      "491": 609,
      "786": 610,
      "563": 611,
      "381": 612,
      "425": 613,
      "410": 614,
      "706": 615,
      "511": 616,
      "529": 617,
      "426": 618,
      "447": 619,
      "453": 620,
      "557": 621,
      "372": 622,
      "423": 623,
      "342": 624,
      "881": 625,
      "415": 626,
      "695": 627,
      "630": 628,
      "5555": 629,
      "801": 630,
      "413": 631,
      "411": 632,
      "427": 633,
      "541": 634,
      "483": 635,
      "418": 636,
      "428": 637,
      "528": 638,
      "792": 639,
      "291": 640,
      "673": 641,
      "438": 642,
      "599": 643,
      "473": 644,
      "800": 645,
      "640": 646,
      "900": 647,
      "322": 648,
      "412": 649,
      "332": 650,
      "544": 651,
      "302": 652,
      "2048": 653,
      "4096": 654,
      "417": 655,
      "391": 656,
      "510": 657,
      "421": 658,
      "960": 659,
      "446": 660,
      "1011": 661,
      "653": 662,
      "1111111111111111": 663,
      "513": 664,
      "493": 665,
      "362": 666,
      "631": 667,
      "520": 668,
      "3600": 669,
      "525": 670,
      "4444": 671,
      "1048": 672,
      "768": 673,
      "660": 674,
      "10000": 675,
      "501": 676,
      "588": 677,
      "0000000": 678,
      "371": 679,
      "001": 680,
      "617": 681,
      "571": 682,
      "613": 683,
      "5040": 684,
      "451": 685,
      "624": 686,
      "908": 687,
      "546": 688,
      "1296": 689,
      "1440": 690,
      "1023": 691,
      "677": 692,
      "661": 693,
      "382": 694,
      "785": 695,
      "648": 696,
      "883": 697,
      "773": 698,
      "514": 699,
      "1310": 700,
      "619": 701,
      "402": 702,
      "895": 703,
      "841": 704,
      "442": 705,
      "727": 706,
      "492": 707,
      "1680": 708,
      "684": 709,
      "2880": 710,
      "1088": 711,
      "1080": 712,
      "2400": 713,
      "701": 714,
      "1001": 715,
      "452": 716,
      "471": 717,
      "1260": 718,
      "991": 719,
      "553": 720,
      "795": 721,
      "691": 722,
      "573": 723,
      "680": 724,
      "1000000000": 725,
      "647": 726,
      "515": 727,
      "1677": 728,
      "518": 729,
      "1280": 730,
      "993": 731,
      "703": 732,
      "872": 733,
      "559": 734,
      "769": 735,
      "756": 736,
      "906": 737,
      "583": 738,
      "006": 739,
      "761": 740,
      "757": 741,
      "719": 742,
      "549": 743,
      "530": 744,
      "659": 745,
      "604": 746,
      "1225": 747,
      "610": 748,
      "550": 749,
      "574": 750,
      "884": 751,
      "804": 752,
      "516": 753,
      "616": 754,
      "751": 755,
      "693": 756,
      "527": 757,
      "787": 758,
      "858": 759,
      "551": 760,
      "521": 761,
      "572": 762,
      "482": 763,
      "663": 764,
      "2520": 765,
      "517": 766,
      "650": 767,
      "681": 768,
      "2800": 769,
      "750": 770,
      "580": 771,
      "700": 772,
      "536": 773,
      "545": 774,
      "554": 775,
      "537": 776,
      "581": 777,
      "612": 778,
      "904": 779,
      "2097": 780,
      "1008": 781,
      "519": 782,
      "603": 783,
      "526": 784,
      "864": 785,
      "1120": 786,
      "1536": 787,
      "1213": 788,
      "961": 789,
      "877": 790,
      "1009": 791,
      "535": 792,
      "780": 793,
      "654": 794,
      "739": 795,
      "2500": 796,
      "793": 797,
      "1089": 798,
      "829": 799,
      "1013": 800,
      "629": 801,
      "1920": 802,
      "548": 803,
      "645": 804,
      "4400": 805,
      "539": 806,
      "1056": 807,
      "1728": 808,
      "674": 809,
      "1212": 810,
      "728": 811,
      "531": 812,
      "627": 813,
      "811": 814,
      "602": 815,
      "502": 816,
      "558": 817,
      "1123": 818,
      "984": 819,
      "994": 820,
      "803": 821,
      "839": 822,
      "556": 823,
      "643": 824,
      "3200": 825,
      "715": 826,
      "986": 827,
      "538": 828,
      "651": 829,
      "823": 830,
      "652": 831,
      "857": 832,
      "874": 833,
      "637": 834,
      "929": 835,
      "688": 836,
      "4800": 837,
      "827": 838,
      "1049": 839,
      "1176": 840,
      "945": 841,
      "1152": 842,
      "735": 843,
      "582": 844,
      "924": 845,
      "657": 846,
      "816": 847,
      "919": 848,
      "714": 849,
      "737": 850,
      "562": 851,
      "733": 852,
      "911": 853,
      "1040": 854,
      "1800": 855,
      "702": 856,
      "859": 857,
      "626": 858,
      "1250": 859,
      "1025": 860,
      "937": 861,
      "743": 862,
      "882": 863,
      "1113": 864,
      "591": 865,
      "1020": 866,
      "642": 867,
      "649": 868,
      "819": 869,
      "903": 870,
      "1050": 871,
      "905": 872,
      "615": 873,
      "730": 874,
      "646": 875,
      "694": 876,
      "682": 877,
      "2560": 878,
      "873": 879,
      "1117": 880,
      "983": 881,
      "1313": 882,
      "1520": 883,
      "636": 884,
      "975": 885,
      "611": 886,
      "671": 887,
      "1019": 888,
      "1216": 889,
      "985": 890,
      "977": 891,
      "2080": 892,
      "1249": 893,
      "1500": 894,
      "1597": 895,
      "699": 896,
      "736": 897,
      "623": 898,
      "620": 899,
      "760": 900,
      "1344": 901,
      "726": 902,
      "783": 903,
      "1297": 904,
      "810": 905,
      "1320": 906,
      "614": 907,
      "987": 908,
      "635": 909,
      "542": 910,
      "781": 911,
      "638": 912,
      "1097": 913,
      "6400": 914,
      "817": 915,
      "967": 916,
      "618": 917,
      "2016": 918,
      "533": 919,
      "692": 920,
      "1223": 921,
      "1129": 922,
      "111111": 923,
      "794": 924,
      "725": 925,
      "971": 926,
      "1039": 927,
      "2304": 928,
      "1277": 929,
      "628": 930,
      "893": 931,
      "740": 932,
      "1717": 933,
      "639": 934,
      "1400": 935,
      "1369": 936,
      "791": 937,
      "2640": 938,
      "1824": 939,
      "947": 940,
      "820": 941,
      "1036": 942,
      "1300": 943,
      "1211": 944,
      "936": 945,
      "1156": 946,
      "1125": 947,
      "870": 948,
      "1360": 949,
      "972": 950,
      "1289": 951,
      "1217": 952,
      "772": 953,
      "774": 954,
      "901": 955,
      "1428": 956,
      "1030": 957,
      "1456": 958,
      "745": 959,
      "658": 960,
      "767": 961,
      "930": 962,
      "1365": 963,
      "1342": 964,
      "1026": 965,
      "894": 966,
      "738": 967,
      "1248": 968,
      "838": 969,
      "746": 970,
      "1069": 971,
      "850": 972,
      "891": 973,
      "748": 974,
      "825": 975,
      "771": 976,
      "717": 977,
      "1029": 978,
      "33333333": 979,
      "644": 980,
      "1093": 981,
      "1087": 982,
      "1224": 983,
      "1560": 984,
      "747": 985,
      "1237": 986,
      "835": 987,
      "848": 988,
      "766": 989,
      "422": 990,
      "100000": 991,
      "713": 992,
      "759": 993,
      "853": 994,
      "522": 995,
      "532": 996,
      "2684": 997,
      "4320": 998,
      "1109": 999,
      "847": 1000,
      "1012": 1001,
      "899": 1002,
      "1430": 1003,
      "861": 1004,
      "1259": 1005,
      "7200": 1006,
      "1760": 1007,
      "3840": 1008,
      "1140": 1009,
      "799": 1010,
      "1399": 1011,
      "788": 1012,
      "828": 1013,
      "1128": 1014,
      "1155": 1015,
      "1279": 1016,
      "723": 1017,
      "1015": 1018,
      "802": 1019,
      "4567": 1020,
      "724": 1021,
      "5600": 1022,
      "1568": 1023,
      "1033": 1024,
      "1229": 1025,
      "863": 1026,
      "928": 1027,
      "980": 1028,
      "1327": 1029,
      "969": 1030,
      "1035": 1031,
      "534": 1032,
      "1016": 1033,
      "1488": 1034,
      "1187": 1035,
      "1429": 1036,
      "1190": 1037,
      "1153": 1038,
      "749": 1039,
      "1367": 1040,
      "716": 1041,
      "892": 1042,
      "966": 1043,
      "1220": 1044,
      "1201": 1045,
      "2200": 1046,
      "860": 1047,
      "543": 1048,
      "1936": 1049,
      "925": 1050,
      "846": 1051,
      "818": 1052,
      "1328": 1053,
      "1512": 1054,
      "662": 1055,
      "5625": 1056,
      "1729": 1057,
      "1764": 1058,
      "836": 1059,
      "812": 1060,
      "765": 1061,
      "1350": 1062,
      "718": 1063,
      "1188": 1064,
      "1330": 1065,
      "981": 1066,
      "2401": 1067,
      "2160": 1068,
      "1057": 1069,
      "1112": 1070,
      "3750": 1071,
      "2000": 1072,
      "868": 1073,
      "1136": 1074,
      "871": 1075,
      "1060": 1076,
      "1326": 1077,
      "1747": 1078,
      "968": 1079,
      "1999": 1080,
      "1059": 1081,
      "879": 1082,
      "1215": 1083,
      "1459": 1084,
      "1875": 1085,
      "1124": 1086,
      "1848": 1087,
      "1716": 1088,
      "1046": 1089,
      "1849": 1090,
      "1168": 1091,
      "5200": 1092,
      "1028": 1093,
      "1027": 1094,
      "782": 1095,
      "1447": 1096,
      "912": 1097,
      "1045": 1098,
      "1170": 1099,
      "1439": 1100,
      "1489": 1101,
      "004": 1102,
      "1458": 1103,
      "1789": 1104,
      "5760": 1105,
      "845": 1106,
      "16384": 1107,
      "4967": 1108,
      "1180": 1109,
      "2688": 1110,
      "1199": 1111,
      "851": 1112,
      "789": 1113,
      "953": 1114,
      "1319": 1115,
      "4836": 1116,
      "1414": 1117,
      "1540": 1118,
      "1376": 1119,
      "1240": 1120,
      "2310": 1121,
      "824": 1122,
      "2147": 1123,
      "744": 1124,
      "712": 1125,
      "856": 1126,
      "1160": 1127,
      "1090": 1128,
      "1616": 1129,
      "973": 1130,
      "989": 1131,
      "1066": 1132,
      "2025": 1133,
      "1058": 1134,
      "11111": 1135,
      "1380": 1136,
      "1619": 1137,
      "633": 1138,
      "1323": 1139,
      "65536": 1140,
      "946": 1141,
      "711": 1142,
      "826": 1143,
      "10101010": 1144,
      "2047": 1145,
      "1014": 1146,
      "000000000": 1147,
      "762": 1148,
      "923": 1149,
      "1159": 1150,
      "1101": 1151,
      "1166": 1152,
      "1759": 1153,
      "758": 1154,
      "005": 1155,
      "1980": 1156,
      "1177": 1157,
      "1499": 1158,
      "927": 1159,
      "1146": 1160,
      "1584": 1161,
      "830": 1162,
      "821": 1163,
      "1368": 1164,
      "1288": 1165,
      "1038": 1166,
      "1890": 1167,
      "32768": 1168,
      "1423": 1169,
      "866": 1170,
      "988": 1171,
      "979": 1172,
      "1640": 1173,
      "1888": 1174,
      "1287": 1175,
      "1037": 1176,
      "1470": 1177,
      "974": 1178,
      "1099": 1179,
      "1840": 1180,
      "1115": 1181,
      "1480": 1182,
      "1424": 1183,
      "1487": 1184,
      "1525": 1185,
      "2040": 1186,
      "837": 1187,
      "1021": 1188,
      "1312": 1189,
      "1427": 1190,
      "1823": 1191,
      "1723": 1192,
      "832": 1193,
      "1549": 1194,
      "1130": 1195,
      "1947": 1196,
      "959": 1197,
      "1847": 1198,
      "1792": 1199,
      "849": 1200,
      "1346": 1201,
      "869": 1202,
      "948": 1203,
      "1063": 1204,
      "1856": 1205,
      "11110": 1206,
      "1523": 1207,
      "1047": 1208,
      "1193": 1209,
      "1230": 1210,
      "917": 1211,
      "950": 1212,
      "40320": 1213,
      "935": 1214,
      "949": 1215,
      "1559": 1216,
      "1068": 1217,
      "1511": 1218,
      "755": 1219,
      "957": 1220,
      "4194": 1221,
      "8192": 1222,
      "1777": 1223,
      "1657": 1224,
      "1567": 1225,
      "1197": 1226,
      "970": 1227,
      "1189": 1228,
      "1889": 1229,
      "1122": 1230,
      "6800": 1231,
      "918": 1232,
      "926": 1233,
      "1638": 1234,
      "3025": 1235,
      "1127": 1236,
      "1079": 1237,
      "1135": 1238,
      "1377": 1239,
      "1345": 1240,
      "1820": 1241,
      "940": 1242,
      "2187": 1243,
      "956": 1244,
      "003": 1245,
      "1290": 1246,
      "1247": 1247,
      "1077": 1248,
      "15625": 1249,
      "3024": 1250,
      "920": 1251,
      "1169": 1252,
      "1669": 1253,
      "1017": 1254,
      "1625": 1255,
      "1860": 1256,
      "962": 1257,
      "833": 1258,
      "2624": 1259,
      "66666666": 1260,
      "1919": 1261,
      "1070": 1262,
      "1258": 1263,
      "1699": 1264,
      "1148": 1265,
      "939": 1266,
      "1144": 1267,
      "855": 1268,
      "951": 1269,
      "3040": 1270,
      "815": 1271,
      "1700": 1272,
      "2480": 1273,
      "1147": 1274,
      "1055": 1275,
      "1444": 1276,
      "1163": 1277,
      "938": 1278,
      "2960": 1279,
      "944": 1280,
      "1307": 1281,
      "1104": 1282,
      "867": 1283,
      "1245": 1284,
      "1114": 1285,
      "1145": 1286,
      "1900": 1287,
      "1137": 1288,
      "1357": 1289,
      "1579": 1290,
      "1179": 1291,
      "1092": 1292,
      "1157": 1293,
      "1373": 1294,
      "862": 1295,
      "1627": 1296,
      "2450": 1297,
      "1134": 1298,
      "1256": 1299,
      "4080": 1300,
      "1697": 1301,
      "1078": 1302,
      "1415": 1303,
      "1149": 1304,
      "1620": 1305,
      "1150": 1306,
      "1098": 1307,
      "1776": 1308,
      "1236": 1309,
      "1235": 1310,
      "1103": 1311,
      "1329": 1312,
      "1051": 1313,
      "1139": 1314,
      "2730": 1315,
      "4560": 1316,
      "1119": 1317,
      "1118": 1318,
      "1648": 1319,
      "2656": 1320,
      "2224": 1321,
      "167772": 1322,
      "0001": 1323,
      "1637": 1324,
      "1270": 1325,
      "1275": 1326,
      "813": 1327,
      "1031": 1328,
      "1409": 1329,
      "634": 1330,
      "1667": 1331,
      "1044": 1332,
      "1490": 1333,
      "1018": 1334,
      "1445": 1335,
      "2700": 1336,
      "2600": 1337,
      "915": 1338,
      "1336": 1339,
      "1750": 1340,
      "2824": 1341,
      "77777777": 1342,
      "1000000": 1343,
      "1105": 1344,
      "3888": 1345,
      "1877": 1346,
      "910": 1347,
      "1116": 1348,
      "2969": 1349,
      "1366": 1350,
      "1590": 1351,
      "1836": 1352,
      "1398": 1353,
      "1599": 1354,
      "916": 1355,
      "1324": 1356,
      "3760": 1357,
      "2657": 1358,
      "1960": 1359,
      "2916": 1360,
      "9600": 1361,
      "8400": 1362,
      "1787": 1363,
      "2720": 1364,
      "1968": 1365,
      "722": 1366,
      "1067": 1367,
      "1457": 1368,
      "1325": 1369,
      "0000000000000000": 1370,
      "978": 1371,
      "1158": 1372,
      "1378": 1373,
      "865": 1374,
      "2816": 1375,
      "1356": 1376,
      "262144": 1377,
      "1359": 1378,
      "1340": 1379,
      "1388": 1380,
      "3125": 1381,
      "1298": 1382,
      "1339": 1383,
      "1656": 1384,
      "1601": 1385,
      "2789": 1386,
      "1650": 1387,
      "4095": 1388,
      "3072": 1389,
      "1425": 1390,
      "1736": 1391,
      "1349": 1392,
      "1198": 1393,
      "1436": 1394,
      "1770": 1395,
      "902": 1396,
      "1379": 1397,
      "1219": 1398,
      "2089": 1399,
      "958": 1400,
      "1138": 1401,
      "753": 1402,
      "1477": 1403,
      "3440": 1404,
      "1460": 1405,
      "1370": 1406,
      "1681": 1407,
      "1879": 1408,
      "2223": 1409,
      "1246": 1410,
      "1433": 1411,
      "1720": 1412,
      "1386": 1413,
      "1267": 1414,
      "710": 1415,
      "1151": 1416,
      "955": 1417,
      "1408": 1418,
      "1575": 1419,
      "1126": 1420,
      "1299": 1421,
      "1530": 1422,
      "3720": 1423,
      "1226": 1424,
      "4900": 1425,
      "1696": 1426,
      "88888888": 1427,
      "1133": 1428,
      "3520": 1429,
      "1266": 1430,
      "1091": 1431,
      "2320": 1432,
      "1076": 1433,
      "2736": 1434,
      "1167": 1435,
      "1374": 1436,
      "632": 1437,
      "1845": 1438,
      "1537": 1439,
      "764": 1440,
      "1257": 1441,
      "1335": 1442,
      "1485": 1443,
      "2357": 1444,
      "1184": 1445,
      "11000": 1446,
      "1453": 1447,
      "2976": 1448,
      "1880": 1449,
      "2592": 1450,
      "7776": 1451,
      "2900": 1452,
      "1449": 1453,
      "2448": 1454,
      "1828": 1455,
      "1317": 1456,
      "3780": 1457,
      "6561": 1458,
      "1866": 1459,
      "1483": 1460,
      "2225": 1461,
      "9090": 1462,
      "1441": 1463,
      "1228": 1464,
      "1547": 1465,
      "1953": 1466,
      "1347": 1467,
      "3536": 1468,
      "1269": 1469,
      "1301": 1470,
      "1548": 1471,
      "622": 1472,
      "2300": 1473,
      "1232": 1474,
      "1666": 1475,
      "1348": 1476,
      "1450": 1477,
      "3680": 1478,
      "4608": 1479,
      "1331": 1480,
      "2748": 1481,
      "1178": 1482,
      "1387": 1483,
      "1867": 1484,
      "734": 1485,
      "1316": 1486,
      "1539": 1487,
      "1679": 1488,
      "2027": 1489,
      "1825": 1490,
      "22222222": 1491,
      "1570": 1492,
      "1227": 1493,
      "1987": 1494,
      "107374": 1495,
      "1435": 1496,
      "1283": 1497,
      "2099": 1498,
      "965": 1499,
      "1768": 1500,
      "4200": 1501,
      "2049": 1502,
      "1557": 1503,
      "2879": 1504,
      "1239": 1505,
      "2050": 1506,
      "2550": 1507,
      "1276": 1508,
      "1096": 1509,
      "1268": 1510,
      "1504": 1511,
      "1617": 1512,
      "1589": 1513,
      "763": 1514,
      "1476": 1515,
      "941": 1516,
      "1065": 1517,
      "1375": 1518,
      "1448": 1519,
      "1979": 1520,
      "2100": 1521,
      "3435": 1522,
      "1756": 1523,
      "2340": 1524,
      "2329": 1525,
      "2399": 1526,
      "1064": 1527,
      "2069": 1528,
      "1528": 1529,
      "2336": 1530,
      "2377": 1531,
      "1061": 1532,
      "1719": 1533,
      "1086": 1534,
      "1578": 1535,
      "1085": 1536,
      "1397": 1537,
      "1416": 1538,
      "1799": 1539,
      "2799": 1540,
      "1740": 1541,
      "1337": 1542,
      "1466": 1543,
      "1446": 1544,
      "1468": 1545,
      "2704": 1546,
      "1830": 1547,
      "14400": 1548,
      "1788": 1549,
      "1577": 1550,
      "1937": 1551,
      "8388": 1552,
      "2339": 1553,
      "2088": 1554,
      "843": 1555,
      "10100": 1556,
      "1870": 1557,
      "754": 1558,
      "1032": 1559,
      "1546": 1560,
      "1550": 1561,
      "1588": 1562,
      "1944": 1563,
      "3579": 1564,
      "1053": 1565,
      "1022": 1566,
      "1469": 1567,
      "1949": 1568,
      "2970": 1569,
      "1255": 1570,
      "1688": 1571,
      "1664": 1572,
      "1437": 1573,
      "2039": 1574,
      "1556": 1575,
      "1587": 1576,
      "1596": 1577,
      "2017": 1578,
      "1333": 1579,
      "2347": 1580,
      "2677": 1581,
      "111111111111": 1582,
      "1569": 1583,
      "3060": 1584,
      "1075": 1585,
      "1524": 1586,
      "2380": 1587,
      "1997": 1588,
      "4960": 1589,
      "1295": 1590,
      "3960": 1591,
      "1467": 1592,
      "1218": 1593,
      "1580": 1594,
      "982": 1595,
      "1647": 1596,
      "2488": 1597,
      "2625": 1598,
      "1538": 1599,
      "834": 1600,
      "1321": 1601,
      "2024": 1602,
      "1535": 1603,
      "1767": 1604,
      "752": 1605,
      "1390": 1606,
      "2352": 1607,
      "854": 1608,
      "732": 1609,
      "1095": 1610,
      "1529": 1611,
      "844": 1612,
      "1566": 1613,
      "1479": 1614,
      "1733": 1615,
      "2744": 1616,
      "1493": 1617,
      "3360": 1618,
      "1171": 1619,
      "1238": 1620,
      "2687": 1621,
      "1183": 1622,
      "1950": 1623,
      "999999": 1624,
      "1303": 1625,
      "1730": 1626,
      "1690": 1627,
      "2029": 1628,
      "1990": 1629,
      "2368": 1630,
      "1658": 1631,
      "5368": 1632,
      "1264": 1633,
      "3856": 1634,
      "1748": 1635,
      "2689": 1636,
      "2835": 1637,
      "2079": 1638,
      "1389": 1639,
      "1850": 1640,
      "2857": 1641,
      "4224": 1642,
      "1393": 1643,
      "1925": 1644,
      "2112": 1645,
      "3527": 1646,
      "1624": 1647,
      "1857": 1648,
      "1358": 1649,
      "2999": 1650,
      "1175": 1651,
      "1278": 1652,
      "1649": 1653,
      "1757": 1654,
      "1827": 1655,
      "2070": 1656,
      "4640": 1657,
      "8800": 1658,
      "1519": 1659,
      "1660": 1660,
      "3969": 1661,
      "1054": 1662,
      "1265": 1663,
      "1521": 1664,
      "1663": 1665,
      "2460": 1666,
      "4032": 1667,
      "3800": 1668,
      "28800": 1669,
      "2699": 1670,
      "1072": 1671,
      "721": 1672,
      "2760": 1673,
      "1744": 1674,
      "2837": 1675,
      "933": 1676,
      "842": 1677,
      "1737": 1678,
      "1419": 1679,
      "2459": 1680,
      "1725": 1681,
      "1455": 1682,
      "2499": 1683,
      "2359": 1684,
      "6720": 1685,
      "1553": 1686,
      "3528": 1687,
      "1420": 1688,
      "1872": 1689,
      "1338": 1690,
      "1645": 1691,
      "1210": 1692,
      "4624": 1693,
      "1766": 1694,
      "1285": 1695,
      "1811": 1696,
      "3300": 1697,
      "0000000000": 1698,
      "2777": 1699,
      "1984": 1700,
      "2940": 1701,
      "3640": 1702,
      "2557": 1703,
      "1332": 1704,
      "1693": 1705,
      "2240": 1706,
      "2809": 1707,
      "3968": 1708,
      "1385": 1709,
      "2646": 1710,
      "1709": 1711,
      "1670": 1712,
      "1222": 1713,
      "1233": 1714,
      "1438": 1715,
      "1780": 1716,
      "2729": 1717,
      "1899": 1718,
      "1632": 1719,
      "2660": 1720,
      "1609": 1721,
      "1254": 1722,
      "2928": 1723,
      "1630": 1724,
      "1043": 1725,
      "1545": 1726,
      "2457": 1727,
      "4620": 1728,
      "268435": 1729,
      "1181": 1730,
      "1073": 1731,
      "1094": 1732,
      "2325": 1733,
      "3648": 1734,
      "1364": 1735,
      "1769": 1736,
      "9999999999999999": 1737,
      "3500": 1738,
      "1555": 1739,
      "1576": 1740,
      "1361": 1741,
      "1940": 1742,
      "1957": 1743,
      "3936": 1744,
      "2087": 1745,
      "2430": 1746,
      "1314": 1747,
      "1668": 1748,
      "4500": 1749,
      "2059": 1750,
      "1753": 1751,
      "1938": 1752,
      "2496": 1753,
      "1426": 1754,
      "2056": 1755,
      "2848": 1756,
      "1165": 1757,
      "1583": 1758,
      "2046": 1759,
      "1395": 1760,
      "1636": 1761,
      "1739": 1762,
      "1234": 1763,
      "2440": 1764,
      "3570": 1765,
      "5400": 1766,
      "1558": 1767,
      "1785": 1768,
      "1869": 1769,
      "1543": 1770,
      "1689": 1771,
      "1745": 1772,
      "1897": 1773,
      "1755": 1774,
      "742": 1775,
      "1698": 1776,
      "4880": 1777,
      "2360": 1778,
      "2333": 1779,
      "2060": 1780,
      "1859": 1781,
      "1873": 1782,
      "2539": 1783,
      "2576": 1784,
      "2647": 1785,
      "621": 1786,
      "1231": 1787,
      "2856": 1788,
      "1196": 1789,
      "1074": 1790,
      "3874": 1791,
      "1244": 1792,
      "1678": 1793,
      "1746": 1794,
      "1956": 1795,
      "1687": 1796,
      "2939": 1797,
      "3080": 1798,
      "1034": 1799,
      "1933": 1800,
      "1837": 1801,
      "1779": 1802,
      "1808": 1803,
      "914": 1804,
      "2366": 1805,
      "741": 1806,
      "954": 1807,
      "11100": 1808,
      "1798": 1809,
      "2090": 1810,
      "2968": 1811,
      "1083": 1812,
      "1887": 1813,
      "1790": 1814,
      "1639": 1815,
      "1727": 1816,
      "1969": 1817,
      "2389": 1818,
      "3000": 1819,
      "1966": 1820,
      "1635": 1821,
      "1598": 1822,
      "1496": 1823,
      "55555555": 1824,
      "2346": 1825,
      "913": 1826,
      "2424": 1827,
      "1629": 1828,
      "1007": 1829,
      "1497": 1830,
      "1935": 1831,
      "1835": 1832,
      "10110": 1833,
      "1143": 1834,
      "1478": 1835,
      "1988": 1836,
      "2528": 1837,
      "1209": 1838,
      "1498": 1839,
      "1646": 1840,
      "1783": 1841,
      "1970": 1842,
      "2376": 1843,
      "3056": 1844,
      "3920": 1845,
      "1081": 1846,
      "2467": 1847,
      "2850": 1848,
      "4736": 1849,
      "2437": 1850,
      "2540": 1851,
      "1185": 1852,
      "8640": 1853,
      "1801": 1854,
      "3900": 1855,
      "2925": 1856,
      "3328": 1857,
      "3400": 1858,
      "1384": 1859,
      "2796": 1860,
      "4300": 1861,
      "2957": 1862,
      "1154": 1863,
      "3556": 1864,
      "10000000": 1865,
      "1626": 1866,
      "2036": 1867,
      "2209": 1868,
      "2888": 1869,
      "1173": 1870,
      "814": 1871,
      "1526": 1872,
      "2226": 1873,
      "1353": 1874,
      "1829": 1875,
      "1355": 1876,
      "4097": 1877,
      "1946": 1878,
      "1763": 1879,
      "1107": 1880,
      "1472": 1881,
      "1552": 1882,
      "943": 1883,
      "1749": 1884,
      "1607": 1885,
      "1758": 1886,
      "2096": 1887,
      "2887": 1888,
      "2860": 1889,
      "2768": 1890,
      "1896": 1891,
      "2525": 1892,
      "1913": 1893,
      "2447": 1894,
      "1948": 1895,
      "1838": 1896,
      "2477": 1897,
      "4088": 1898,
      "1977": 1899,
      "3088": 1900,
      "1613": 1901,
      "1738": 1902,
      "1002": 1903,
      "10080": 1904,
      "10001": 1905,
      "1186": 1906,
      "1659": 1907,
      "2345": 1908,
      "2356": 1909,
      "4768": 1910,
      "2066": 1911,
      "2549": 1912,
      "2337": 1913,
      "1989": 1914,
      "2556": 1915,
      "1464": 1916,
      "1926": 1917,
      "1826": 1918,
      "1164": 1919,
      "1858": 1920,
      "1945": 1921,
      "1839": 1922,
      "2727": 1923,
      "4656": 1924,
      "7056": 1925,
      "1655": 1926,
      "100000000": 1927,
      "3445": 1928,
      "1243": 1929,
      "1930": 1930,
      "1475": 1931,
      "2053": 1932,
      "2465": 1933,
      "2579": 1934,
      "2028": 1935,
      "1274": 1936,
      "2801": 1937,
      "1451": 1938,
      "1929": 1939,
      "4225": 1940,
      "1192": 1941,
      "1517": 1942,
      "1048576": 1943,
      "2490": 1944,
      "2328": 1945,
      "3089": 1946,
      "1443": 1947,
      "1527": 1948,
      "2228": 1949,
      "852": 1950,
      "2058": 1951,
      "2584": 1952,
      "2659": 1953,
      "1846": 1954,
      "1998": 1955,
      "2250": 1956,
      "2690": 1957,
      "1121": 1958,
      "1868": 1959,
      "2350": 1960,
      "2369": 1961,
      "1958": 1962,
      "3776": 1963,
      "4000": 1964,
      "1381": 1965,
      "3329": 1966,
      "1876": 1967,
      "2384": 1968,
      "2227": 1969,
      "9216": 1970,
      "1463": 1971,
      "5728": 1972,
      "2064": 1973,
      "2464": 1974,
      "3696": 1975,
      "1286": 1976,
      "963": 1977,
      "1481": 1978,
      "2767": 1979,
      "1162": 1980,
      "2388": 1981,
      "1573": 1982,
      "2470": 1983,
      "1392": 1984,
      "1595": 1985,
      "1797": 1986,
      "1964": 1987,
      "2580": 1988,
      "4600": 1989,
      "1253": 1990,
      "1586": 1991,
      "2057": 1992,
      "964": 1993,
      "1394": 1994,
      "671088": 1995,
      "1465": 1996,
      "2330": 1997,
      "1959": 1998,
      "3216": 1999,
      "131072": 2000,
      "2679": 2001,
      "3424": 2002,
      "1904": 2003,
      "1967": 2004,
      "2037": 2005,
      "1291": 2006,
      "2045": 2007,
      "2680": 2008,
      "2949": 2009,
      "1806": 2010,
      "4294967": 2011,
      "1372": 2012,
      "1544": 2013,
      "4680": 2014,
      "2111": 2015,
      "6543": 2016,
      "1735": 2017,
      "1778": 2018,
      "1818": 2019,
      "2890": 2020,
      "2645": 2021,
      "1003": 2022,
      "2756": 2023,
      "3889": 2024,
      "3049": 2025,
      "2197": 2026,
      "1939": 2027,
      "2469": 2028,
      "6300": 2029,
      "2897": 2030,
      "1585": 2031,
      "3003": 2032,
      "1174": 2033,
      "3599": 2034,
      "1471": 2035,
      "2030": 2036,
      "2068": 2037,
      "1898": 2038,
      "2479": 2039,
      "2309": 2040,
      "1978": 2041,
      "2864": 2042,
      "2749": 2043,
      "1293": 2044,
      "2063": 2045,
      "1363": 2046,
      "2348": 2047,
      "2666": 2048,
      "1396": 2049,
      "1885": 2050,
      "2456": 2051,
      "46656": 2052,
      "5776": 2053,
      "1194": 2054,
      "1973": 2055,
      "3584": 2056,
      "2229": 2057,
      "1484": 2058,
      "2390": 2059,
      "4657": 2060,
      "4336": 2061,
      "2745": 2062,
      "2601": 2063,
      "2311": 2064,
      "2379": 2065,
      "3037": 2066,
      "3067": 2067,
      "4720": 2068,
      "1084": 2069,
      "1515": 2070,
      "6080": 2071,
      "1311": 2072,
      "1005": 2073,
      "1284": 2074,
      "1855": 2075,
      "731": 2076,
      "1628": 2077,
      "1819": 2078,
      "2667": 2079,
      "952": 2080,
      "4440": 2081,
      "2211": 2082,
      "1665": 2083,
      "1342177": 2084,
      "1676": 2085,
      "3540": 2086,
      "1452": 2087,
      "2570": 2088,
      "21474836": 2089,
      "1343": 2090,
      "1352": 2091,
      "2670": 2092,
      "5840": 2093,
      "1765": 2094,
      "2449": 2095,
      "2349": 2096,
      "2840": 2097,
      "2980": 2098,
      "3079": 2099,
      "2220": 2100,
      "1309": 2101,
      "1486": 2102,
      "1878": 2103,
      "2990": 2104,
      "4896": 2105,
      "3136": 2106,
      "1412": 2107,
      "362880": 2108,
      "4447": 2109,
      "3568": 2110,
      "44444444": 2111,
      "2588": 2112,
      "2393": 2113,
      "2780": 2114,
      "6736": 2115,
      "2547": 2116,
      "2899": 2117,
      "11011": 2118,
      "1417": 2119,
      "1407": 2120,
      "2002": 2121,
      "1993": 2122,
      "2083": 2123,
      "3456": 2124,
      "5440": 2125,
      "3880": 2126,
      "822": 2127,
      "1273": 2128,
      "2035": 2129,
      "2436": 2130,
      "2637": 2131,
      "2750": 2132,
      "4688": 2133,
      "2977": 2134,
      "2648": 2135,
      "3499": 2136,
      "1406": 2137,
      "2658": 2138,
      "1495": 2139,
      "2548": 2140,
      "2323": 2141,
      "2798": 2142,
      "3700": 2143,
      "335544": 2144,
      "1928": 2145,
      "3890": 2146,
      "1775": 2147,
      "2466": 2148,
      "4536": 2149,
      "2790": 2150,
      "2747": 2151,
      "932": 2152,
      "1221": 2153,
      "1565": 2154,
      "2468": 2155,
      "7680": 2156,
      "2593": 2157,
      "4928": 2158,
      "2116": 2159,
      "1106": 2160,
      "2416": 2161,
      "11111111111111111111111111111111": 2162,
      "5000": 2163,
      "2370": 2164,
      "2335": 2165,
      "2559": 2166,
      "3877": 2167,
      "1513": 2168,
      "2568": 2169,
      "2737": 2170,
      "1305": 2171,
      "2230": 2172,
      "3120": 2173,
      "3636": 2174,
      "3449": 2175,
      "2797": 2176,
      "3347": 2177,
      "2011": 2178,
      "2944": 2179,
      "2067": 2180,
      "2650": 2181,
      "3967": 2182,
      "2489": 2183,
      "1195": 2184,
      "1052": 2185,
      "2912": 2186,
      "4944": 2187,
      "1308": 2188,
      "2628": 2189,
      "6048": 2190,
      "2609": 2191,
      "1712": 2192,
      "2280": 2193,
      "2398": 2194,
      "2929": 2195,
      "3956": 2196,
      "5856": 2197,
      "3588": 2198,
      "16777216": 2199,
      "10101": 2200,
      "2728": 2201,
      "2784": 2202,
      "390625": 2203,
      "1976": 2204,
      "2077": 2205,
      "2948": 2206,
      "3557": 2207,
      "1724": 2208,
      "2788": 2209,
      "2367": 2210,
      "4700": 2211,
      "5050": 2212,
      "1404": 2213,
      "3336": 2214,
      "3529": 2215,
      "3583": 2216,
      "4545": 2217,
      "2738": 2218,
      "2889": 2219,
      "4040": 2220,
      "1621": 2221,
      "2213": 2222,
      "5184": 2223,
      "2590": 2224,
      "2653": 2225,
      "3779": 2226,
      "5920": 2227,
      "1563": 2228,
      "2770": 2229,
      "4687": 2230,
      "2221": 2231,
      "2378": 2232,
      "3797": 2233,
      "3504": 2234,
      "1518": 2235,
      "1786": 2236,
      "4448": 2237,
      "3430": 2238,
      "1208": 2239,
      "2113": 2240,
      "2992": 2241,
      "4969": 2242,
      "1006": 2243,
      "1214": 2244,
      "00000000000": 2245,
      "7560": 2246,
      "4056": 2247,
      "3539": 2248,
      "2098": 2249,
      "3048": 2250,
      "3590": 2251,
      "1004": 2252,
      "1593": 2253,
      "2668": 2254,
      "2208": 2255,
      "1653": 2256,
      "1554": 2257,
      "1975": 2258,
      "2324": 2259,
      "2870": 2260,
      "3660": 2261,
      "2387": 2262,
      "2097152": 2263,
      "1042": 2264,
      "2566": 2265,
      "3645": 2266,
      "1886": 2267,
      "1111111": 2268,
      "1533": 2269,
      "2358": 2270,
      "3524": 2271,
      "1205": 2272,
      "1726": 2273,
      "1985": 2274,
      "2752": 2275,
      "1683": 2276,
      "1952": 2277,
      "19683": 2278,
      "2769": 2279,
      "4777": 2280,
      "1907": 2281,
      "1924": 2282,
      "2577": 2283,
      "3737": 2284,
      "9900": 2285,
      "4576": 2286,
      "1302": 2287,
      "1505": 2288,
      "4801": 2289,
      "1041": 2290,
      "4704": 2291,
      "2020": 2292,
      "2877": 2293,
      "1721": 2294,
      "2956": 2295,
      "3090": 2296,
      "2869": 2297,
      "3757": 2298,
      "4950": 2299,
      "1644": 2300,
      "3448": 2301,
      "2766": 2302,
      "1294": 2303,
      "1864": 2304,
      "2875": 2305,
      "3240": 2306,
      "3099": 2307,
      "2178": 2308,
      "4048": 2309,
      "4049": 2310,
      "2836": 2311,
      "3580": 2312,
      "2945": 2313,
      "3087": 2314,
      "3824": 2315,
      "1995": 2316,
      "2636": 2317,
      "4556": 2318,
      "1315": 2319,
      "1432": 2320,
      "1454": 2321,
      "4099": 2322,
      "1901": 2323,
      "20160": 2324,
      "8960": 2325,
      "2383": 2326,
      "2787": 2327,
      "6336": 2328,
      "1686": 2329,
      "1418": 2330,
      "2597": 2331,
      "4649": 2332,
      "2649": 2333,
      "1413": 2334,
      "1741": 2335,
      "2179": 2336,
      "2988": 2337,
      "6435": 2338,
      "6144": 2339,
      "1633": 2340,
      "1482": 2341,
      "1531": 2342,
      "1796": 2343,
      "2530": 2344,
      "3728": 2345,
      "1354": 2346,
      "2578": 2347,
      "2917": 2348,
      "4760": 2349,
      "1474": 2350,
      "1865": 2351,
      "2635": 2352,
      "7500": 2353,
      "2445": 2354,
      "1844": 2355,
      "3940": 2356,
      "1062": 2357,
      "2544": 2358,
      "2936": 2359,
      "2989": 2360,
      "3740": 2361,
      "1405": 2362,
      "2698": 2363,
      "3876": 2364,
      "5984": 2365,
      "1695": 2366,
      "1861": 2367,
      "3433": 2368,
      "2950": 2369,
      "1272": 2370,
      "2599": 2371,
      "2569": 2372,
      "2849": 2373,
      "3777": 2374,
      "2120": 2375,
      "922": 2376,
      "1854": 2377,
      "2746": 2378,
      "3150": 2379,
      "1234567": 2380,
      "2326": 2381,
      "2757": 2382,
      "1955": 2383,
      "2772": 2384,
      "1281": 2385,
      "3045": 2386,
      "4799": 2387,
      "2937": 2388,
      "5680": 2389,
      "9200": 2390,
      "8191": 2391,
      "1685": 2392,
      "2032": 2393,
      "4848": 2394,
      "2038": 2395,
      "7600": 2396,
      "5120": 2397,
      "1411": 2398,
      "1564": 2399,
      "2439": 2400,
      "1675": 2401,
      "1473": 2402,
      "2966": 2403,
      "1262": 2404,
      "2896": 2405,
      "1304": 2406,
      "1383": 2407,
      "8880": 2408,
      "2808": 2409,
      "2026": 2410,
      "2338": 2411,
      "16800": 2412,
      "2417": 2413,
      "4840": 2414,
      "2044": 2415,
      "2438": 2416,
      "3744": 2417,
      "6656": 2418,
      "2081": 2419,
      "3057": 2420,
      "4544": 2421,
      "1743": 2422,
      "2867": 2423,
      "4590": 2424,
      "2184": 2425,
      "931": 2426,
      "1682": 2427,
      "2512": 2428,
      "2207": 2429,
      "2287": 2430,
      "2078": 2431,
      "1874": 2432,
      "2446": 2433,
      "1494": 2434,
      "2375": 2435,
      "2290": 2436,
      "2475": 2437,
      "2145": 2438,
      "1711": 2439,
      "2589": 2440,
      "2859": 2441,
      "4580": 2442,
      "2161": 2443,
      "2190": 2444,
      "2536": 2445,
      "2558": 2446,
      "934": 2447,
      "2385": 2448,
      "3577": 2449,
      "1710": 2450,
      "2608": 2451,
      "2092": 2452,
      "10010": 2453,
